tap "azure/functions"
tap "d12frosted/emacs-plus"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
# Image format providing lossless and lossy compression for web images
brew "webp"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Core application library for C
brew "glib"
# Cross-platform make
brew "cmake"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Generic library support script
brew "libtool"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# OpenType text shaping engine
brew "harfbuzz"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Command-line, double-entry accounting tool
brew "ledger"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# C library SSHv1/SSHv2 client and server protocols
brew "libssh"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# HTTP/2 C Library
brew "nghttp2"
# Platform built on V8 to build network applications
brew "node"
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Steel Bank Common Lisp system
brew "sbcl"
# Azure Functions Core Tools 3.0
brew "azure/functions/azure-functions-core-tools@3"
brew "d12frosted/emacs-plus/emacs-plus@27", args: ["with-nobu417-big-sur-icon"]
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# Text editor
cask "emacs"
# Light, Electron-based Wrapper around GraphiQL
cask "graphiql"
# Tool to invert scroll direction for physical scroll wheels
cask "unnaturalscrollwheels"
# Network protocol analyzer
cask "wireshark"
